a=(input('Введите строку ')).lower()
"""Попросим ввести пользователя оценку по предмету через -"""
a=a.split('-')
"""Разделим на части по -"""
i=0
e=0
g=('историягеографияобществознаиниерусскийлитература')
s=('математика','физика','химия','биология')
"""Создадим кортежи с названиями предметов"""
while a[0] != 'стоп':
  if a[0] in s:
    f=int(a[1])
    i=i+1
    e=e+f
    print(e/i)
    a=(input('Введите строку ')).lower()
    a=a.split('-')
  elif a[0] in g:
    a=(input('Введите строку ')).lower()
    a=a.split('-')
  else:
    a=(input('Введите строку ')).lower()
    a=a.split('-')
"""Создадим цикл, который будет выполнятся до того, пока не введут слово стоп.В цикле создадим условие,с помощью 
которого будем подсчитывать среднее арифметическое с помощью переменных i и e,а также ,если это гуманитарный предмет,
будет просто игнорировать ввод"""
     